## Setup

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
# Connect to sakila MySQL database
%sql mysql+mysqlconnector://iliarudiak:password@iliarudiak-macbook.local:3306/sakila

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Exercises

### Exercise 3-1

In [6]:
%%sql
-- Retrieve the actor ID, first name, and last name for all actors. Sort by last name and
-- then by first name.

SELECT actor_id, first_name, last_name
FROM actor
ORDER BY last_name, first_name
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(58, 'CHRISTIAN', 'AKROYD'),
 (182, 'DEBBIE', 'AKROYD'),
 (92, 'KIRSTEN', 'AKROYD'),
 (118, 'CUBA', 'ALLEN'),
 (145, 'KIM', 'ALLEN')]

### Exercise 3-2

In [7]:
%%sql
-- Retrieve the actor ID, first name, and last name for all actors whose last name equals
-- 'WILLIAMS' or 'DAVIS'.

SELECT actor_id, first_name, last_name
FROM actor
WHERE last_name IN ('WILLIAMS', 'DAVIS');

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
6 rows affected.

[(4, 'JENNIFER', 'DAVIS'),
 (101, 'SUSAN', 'DAVIS'),
 (110, 'SUSAN', 'DAVIS'),
 (72, 'SEAN', 'WILLIAMS'),
 (137, 'MORGAN', 'WILLIAMS'),
 (172, 'GROUCHO', 'WILLIAMS')]

### Exercise 3-3

In [ ]:
# Write a query against the rental table that returns the IDs of the customers who ren‚Äê
# ted a film on July 5, 2005 (use the rental.rental_date column, and you can use the
# date() function to ignore the time component). Include a single row for each distinct
# customer ID.

In [9]:
%%sql
SELECT DISTINCT customer_id, rental_date
FROM rental
WHERE DATE(rental_date) = '2005-07-05'
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(565, datetime.datetime(2005, 7, 5, 22, 49, 24)),
 (242, datetime.datetime(2005, 7, 5, 22, 51, 44)),
 (37, datetime.datetime(2005, 7, 5, 22, 56, 33)),
 (60, datetime.datetime(2005, 7, 5, 22, 57, 34)),
 (594, datetime.datetime(2005, 7, 5, 22, 59, 53))]

## Exercise 3-4

In [10]:
%%sql
SELECT c.email, r.return_date
FROM customer c
INNER JOIN rental r
ON c.customer_id = r.customer_id
WHERE date(r.rental_date) = '2005-06-14'
ORDER BY r.return_date DESC;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
16 rows affected.

[('DANIEL.CABRAL@sakilacustomer.org', datetime.datetime(2005, 6, 23, 22, 0, 38)),
 ('TERRANCE.ROUSH@sakilacustomer.org', datetime.datetime(2005, 6, 23, 21, 53, 46)),
 ('MIRIAM.MCKINNEY@sakilacustomer.org', datetime.datetime(2005, 6, 21, 17, 12, 8)),
 ('GWENDOLYN.MAY@sakilacustomer.org', datetime.datetime(2005, 6, 20, 2, 40, 27)),
 ('JEANETTE.GREENE@sakilacustomer.org', datetime.datetime(2005, 6, 19, 23, 26, 46)),
 ('HERMAN.DEVORE@sakilacustomer.org', datetime.datetime(2005, 6, 19, 3, 20, 9)),
 ('JEFFERY.PINSON@sakilacustomer.org', datetime.datetime(2005, 6, 18, 21, 37, 33)),
 ('MATTHEW.MAHAN@sakilacustomer.org', datetime.datetime(2005, 6, 18, 5, 18, 58)),
 ('MINNIE.ROMERO@sakilacustomer.org', datetime.datetime(2005, 6, 18, 1, 58, 34)),
 ('SONIA.GREGORY@sakilacustomer.org', datetime.datetime(2005, 6, 17, 21, 44, 11)),
 ('TERRENCE.GUNDERSON@sakilacustomer.org', datetime.datetime(2005, 6, 17, 5, 28, 35)),
 ('ELMER.NOE@sakilacustomer.org', datetime.datetime(2005, 6, 17, 2, 11, 13)),
 ('JOYCE.EDWARDS@sakilacustomer.org', datetime.datetime(2005, 6, 16, 21, 0, 26)),
 ('AMBER.DIXON@sakilacustomer.org', datetime.datetime(2005, 6, 16, 4, 2, 56)),
 ('CHARLES.KOWALSKI@sakilacustomer.org', datetime.datetime(2005, 6, 16, 2, 26, 34)),
 ('CATHERINE.CAMPBELL@sakilacustomer.org', datetime.datetime(2005, 6, 15, 20, 43, 3))]